# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# Выведите на экран.

i_1 = 1
i_2 = 1.1
print(i_1, i_2, sep=' and ')

str_1 = 'Hello'
str_2 = "World"
print(f'{str_1}, {str_2}!')

user_i = int(input('Введите число: '))
user_str = input('Введите что-нибудь: ')
print(f'{user_i}, {user_str}.')
